<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [142]:
import pandas as pd
import psycopg2
import requests
from bs4 import BeautifulSoup # Импортируем библиотеку BeautifulSoup

In [144]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [145]:
# текст запроса
query_3_1 = f'''select*
                from public.vacancies
                
'''

vacancies = pd.read_sql_query(query_3_1, connection)
vacancies

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,55312386,Компьютерный Мастер,Пользователь ПК\tРабота в команде\tРемонт ноут...,Полный день,Нет опыта,Полная занятость,64000.0,NaN,1516,5724811
1,55843014,Системный администратор,Средства криптографической защиты информации\t...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,130,4903713
2,54525964,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,160,69961
3,54525965,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,159,69961
4,55354053,Специалист службы поддержки с техническими зна...,None,Удаленная работа,Нет опыта,Частичная занятость,15000.0,NaN,1955,1740
...,...,...,...,...,...,...,...,...,...,...
49192,55589514,Специалист по информационным технологиям,Электронный документооборот\t1С: Предприятие 8...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,66,5109332
49193,55029668,Руководитель процессного офиса,Оптимизация бизнес-процессов\tСтратегическое м...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,26,51333
49194,66172263,Начальник сервисной службы,Организаторские навыки\tУправление персоналом\...,Полный день,От 1 года до 3 лет,Полная занятость,60000.0,NaN,1930,4094700
49195,66180086,Senior IOS разработчик,Swift\tRealm\tiOS\tАнглийский язык\tMVP\tMVVM\...,Полный день,От 1 года до 3 лет,Полная занятость,146456.0,244094.0,160,4469939
49196,55547842,DataOps Engineer,None,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,160,4978627

In [146]:
# результат запроса
print(vacancies["id"].count())

49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [147]:
# текст запроса
query_3_2 = f'''select*
                from public.employers
                                
'''
employers = pd.read_sql_query(query_3_2, connection)
employers

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

            id                                               name  area
0         2393                   Программный Продукт, ИТ-компания     1
1        72977                                          БАРС Груп    88
2         3155  Бест, Торгово-производственная компания, Екате...     3
3          675                                   КОРУС Консалтинг     2
4      1840010  филиал ФКУ Налог-Сервис ФНС России в Республик...    88
...        ...                                                ...   ...
23496  1441774                                              МарКо    88
23497  4718575                                      MKomov Studio    73
23498  3702770                                  АКИБ Ипотека-банк  2759
23499  5636092                                        ГИМ-КЛИНИКА    99
23500  2064382                                             Рыббла   104

[23501 rows x 3 columns]

In [148]:
# результат запроса
print(employers["id"].count())

23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [149]:
# текст запроса
query_3_3 = f'''select*
                from public.areas
                                
'''
areas = pd.read_sql_query(query_3_3, connection)
areas

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

        id              name
0     2758           Тбилиси
1        8            Майкоп
2     1180          Нерюнгри
3     1240       Новокузнецк
4        2   Санкт-Петербург
...    ...               ...
1357  5043  Звёздный Городок
1358  3934       Воротынск\n
1359  4825             Чемал
1360  3708         Усть-Нера
1361  2432         Каневская

[1362 rows x 2 columns]

In [150]:
# результат запроса
print(areas["id"].count())

1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [151]:
# текст запроса
query_3_4 = f'''select*
                from public.industries
                                
'''
industries = pd.read_sql_query(query_3_4, connection)
industries

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

          id                                               name
0      7.540                Разработка программного обеспечения
1      7.539  Системная интеграция,  автоматизации технологи...
2     27.550              Безалкогольные напитки (производство)
3     27.551  Безалкогольные напитки (продвижение, оптовая т...
4     13.664             Управление и эксплуатация недвижимости
..       ...                                                ...
289   37.626             Ассоциация в сфере культуры, искусства
290   42.603                              Табак  (производство)
291   29.532                           Рыболовство, рыбоводство
292   37.627                      Благотворительная организация
293  388.505  Оборудование для деревообработки, заготовки ле...

[294 rows x 2 columns]

In [152]:
# результат запроса
print(industries["id"].count())

294

***

In [153]:
# выводы по предварительному анализу данных
# На данный момент в базе 294 разных сфер деятельности в 1362 регионах по которой 49197 вакансий и 23501 работодателей.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [154]:
# текст запроса
query_4_1 = f'''select a.name, count(*)
                from public.areas a 
                join public.vacancies v on v.area_id = a.id
                group by 1
                order by 2 desc
'''

In [155]:
# результат запроса
area_num_of_vacan = pd.read_sql_query(query_4_1, connection)
area_num_of_vacan

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                name  count
0             Москва   5333
1    Санкт-Петербург   2851
2              Минск   2112
3        Новосибирск   2006
4             Алматы   1892
..               ...    ...
764       Тарко-Сале      1
765    Новоаннинский      1
766            Бирск      1
767           Сасово      1
768             Анна      1

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [156]:
# текст запроса
query_4_2 = f'''select*
                from public.vacancies
                where (salary_from is not null) or (salary_to is not null)
                
'''

In [157]:
# результат запроса
salary_notnull = pd.read_sql_query(query_4_2, connection)
salary_notnull

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,55312386,Компьютерный Мастер,Пользователь ПК\tРабота в команде\tРемонт ноут...,Полный день,Нет опыта,Полная занятость,64000.0,NaN,1516,5724811
1,55354053,Специалист службы поддержки с техническими зна...,None,Удаленная работа,Нет опыта,Частичная занятость,15000.0,NaN,1955,1740
2,55050261,Инженер-программист,Java SE\tSpring Framework\tSpring Boot\tGit\tS...,Полный день,Нет опыта,Полная занятость,40000.0,60000.0,49,4448636
3,55583432,Системный администратор,Linux\tАдминистрирование сетевого оборудования...,Полный день,От 1 года до 3 лет,Полная занятость,50000.0,NaN,3,55126
4,55471342,Ведущий программист 1C,PostgreSQL\tSQL\tLinux\t1С программирование\tM...,Удаленная работа,От 3 до 6 лет,Полная занятость,150000.0,NaN,2813,3682876
...,...,...,...,...,...,...,...,...,...,...
24068,55874997,Специалист сопровождения медицинской информаци...,Аналитическое мышление\tИнформационные техноло...,Полный день,Нет опыта,Полная занятость,50000.0,NaN,2,1062575
24069,55291789,Аналитик бизнес-процессов,Моделирование бизнес процессов\tРазработка тех...,Полный день,От 1 года до 3 лет,Полная занятость,102500.0,NaN,2077,2173850
24070,51883918,Технический писатель (Платформа СБИС),Деловая переписка\tПрограммирование\tТехническ...,Полный день,Нет опыта,Полная занятость,40000.0,78000.0,99,67611
24071,66172263,Начальник сервисной службы,Организаторские навыки\tУправление персоналом\...,Полный день,От 1 года до 3 лет,Полная занятость,60000.0,NaN,1930,4094700
24072,66180086,Senior IOS разработчик,Swift\tRealm\tiOS\tАнглийский язык\tMVP\tMVVM\...,Полный день,От 1 года до 3 лет,Полная занятость,146456.0,244094.0,160,4469939

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [158]:
# текст запроса
query_4_3 = f'''select avg(salary_from), avg(salary_to)
                from public.vacancies
                
                '''

In [159]:
# результат запроса
avg_salary = pd.read_sql_query(query_4_3, connection)
round(avg_salary)

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

       avg       avg
0  71065.0  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [160]:
# текст запроса
query_4_4 = f'''select schedule, 
                employment,
                count(*)
                from public.vacancies
                group by 1,2
                order by 3 desc
                
                '''

In [161]:
# результат запроса
schedule_employment = pd.read_sql_query(query_4_4, connection)
schedule_employment

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [162]:
# текст запроса
query_4_5 = f'''select experience, count(*)
                from public.vacancies
                group by 1
                order by 2
                
                '''

In [163]:
# результат запроса
experience_count = pd.read_sql_query(query_4_5, connection)
experience_count

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [164]:
# выводы по детальному анализу вакансий
# Наибольшее количество вакансий в регионах - Москва, Санкт-Петербург, Минск, Новосибирск, Алматы. 
# Опираясь на уровень заработной плате, можно сделать вывод что средние значения для нижней границы 71.065 руб. и верхней 110.537 руб. по данным примерно половины вакансий. 
# Самый популярный тип трудоустройства «Полная занятость» при удаленном или полном рабочем дне и опытом работы от 1 до 3 лет, а также от 3 до 6 лет

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [165]:
# текст запроса
query_5_1 = f'''(select e.name, count(*)
                from public.employers e 
                join public.vacancies v on v.employer_id = e.id
                group by 1
                order by 2 desc
                limit 1)
                union all
                (select e.name, count(*)
                from public.employers e 
                join public.vacancies v on v.employer_id = e.id
                group by 1
                order by 2 desc
                offset 4 limit 1)
                '''

In [166]:
# результат запроса
employers_vac_count = pd.read_sql_query(query_5_1, connection)
employers_vac_count

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

            name  count
0         Яндекс   1933
1  Газпром нефть    331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [167]:
# текст запроса
query_5_2 = f'''select a.name, count(e.id) employers, count(v.id) vacancies
                from public.areas a
                left join public.employers e on a.id = e.area
                left join public.vacancies v on v.area_id = a.id
                where v.id is null
                group by a.name
                order by 2 desc

                '''

In [168]:
# результат запроса
area_emp_vac = pd.read_sql_query(query_5_2, connection)
area_emp_vac

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                               name  employers  vacancies
0                            Россия        410          0
1                         Казахстан        207          0
2                Московская область         75          0
3                Краснодарский край         19          0
4                          Беларусь         18          0
..                              ...        ...        ...
588                        Кувандык          0          0
589                        Куйбышев          0          0
590  Куйбышево (Ростовская область)          0          0
591                        Култаево          0          0
592                        Кульсары          0          0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [169]:
# текст запроса
query_5_3 = f'''select e.name, count(distinct v.area_id) area
                from public.employers e
                left join public.vacancies v on e.id = v.employer_id
                where v.id is not null            
                GROUP BY 1
                order by 2 desc

                '''

In [170]:
# результат запрос
emp_area_vac = pd.read_sql_query(query_5_3, connection)
emp_area_vac

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                         name  area
0                      Яндекс   181
1                  Ростелеком   152
2                  Спецремонт   116
3      Поляков Денис Иванович    88
4                   ООО ЕФИН     71
...                       ...   ...
14761                  UniSol     1
14762            UNISTORY LLC     1
14763                   UNIT6     1
14764     United Distribution     1
14765              UNITEL LLC     1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [199]:
# текст запроса
query_5_4 = f'''select*
                from public.employers e
                left join employers_industries ei on e.id = ei.employer_id
                where ei.industry_id is null

                '''

In [200]:
# результат запроса
emp_area_vac = pd.read_sql_query(query_5_4, connection)
emp_area_vac

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,id,name,area,employer_id,industry_id
0,3097282,Вертикаль,3,None,None
1,2603367,Нозиков Денис Михайлович,83,None,None
2,2523114,МВД России по Республике Башкортостан,99,None,None
3,4873921,ГКУ «Центр цифровой трансформации РТ»,88,None,None
4,3182417,"Театральный музей им. А.А. Бахрушина, ФГБУК ГЦТМ",1,None,None
...,...,...,...,...,...
8414,215771,СвязьИнформ,24,None,None
8415,5596143,ГОКУ ЦОСУМС,64,None,None
8416,2835381,Сыктывкарская Швейная Фабрика Текстиль Коми,51,None,None
8417,6126288,FINOM TECH LTD,236,None,None
8418,6159826,Группа компаний Планета,22,None,None

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [173]:
# текст запроса
query_5_5 = f'''select e.name, ei.employer_id, count(distinct ei.industry_id)
                from public.employers e
                left join employers_industries ei on e.id = ei.employer_id
                GROUP BY e.id, ei.employer_id
                having count(ei.industry_id) = 4
                order by 1
                offset 2 limit 1
                
                

                '''

In [174]:
# результат запроса
emp_ind = pd.read_sql_query(query_5_5, connection)
emp_ind

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   name  employer_id  count
0  2ГИС        64174      4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [233]:
# текст запроса
query_5_6 = f'''select count(*)
                from public.employers_industries ei
                left join industries i on ei.industry_id = i.id
                where i.name Like '%_азработка программного обеспечения%'

                '''

In [234]:
# результат запроса
emp_ind = pd.read_sql_query(query_5_6, connection)
emp_ind

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [177]:
# код для получения списка городов-милионников
url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8' # Задаём адрес ресурса
response = requests.get(url) # Делаем GET-запрос к ресурсу
page = BeautifulSoup(response.text, 'html.parser') # Создаём объект BeautifulSoup
print(page.find('a')) # Ищем ссылку по тегу <a> и выводим её на экран
cities = page.find_all('a') # Ищем все ссылки на странице и сохраняем в переменной cities в виде списка
print(len(cities))
cities = [city.text for city in cities[45:62]]
print(cities)

<a id="top"></a>
1029
['Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж', '[a]', 'Пермь', 'Волгоград']

In [178]:
# текст запроса
cities = tuple(cities)
query_5_7 = f'''select a.name, count(v.id)
                from public.areas a 
                join public.vacancies v on v.area_id = a.id
                join public.employers e on e.id = v.employer_id
                where a.name IN {cities} and e.name like '_ндекс'
                GROUP BY 1 
                
                
                UNION ALL
                
                select 'total', count(v.id)
                from public.areas a 
                join public.vacancies v on v.area_id = a.id
                join public.employers e on e.id = v.employer_id
                where a.name IN {cities} and e.name like '_ндекс'
                order by 2
            
            
                '''

In [179]:
# результат запроса
yandex = pd.read_sql_query(query_5_7, connection)
yandex

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

               name  count
0              Омск     21
1         Челябинск     22
2        Красноярск     23
3         Волгоград     24
4             Пермь     25
5            Казань     25
6    Ростов-на-Дону     25
7               Уфа     26
8            Самара     26
9         Краснодар     30
10          Воронеж     32
11      Новосибирск     35
12  Нижний Новгород     36
13     Екатеринбург     39
14  Санкт-Петербург     42
15           Москва     54
16            total    485

***

In [180]:
# выводы по анализу работодателей
# В топ 5 по количеству вакансий и регионов присутствия в России входят Яндекс, Ростелеком, Тинькофф и Газпром нефть. Яндекс является лидером.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [181]:
# текст запроса
query_6_1 = f'''select count(*)
                from public.vacancies
                where lower(name) LIKE '%data%' or lower(name) LIKE '%данн%'
            
                '''

In [182]:
# результат запроса
data = pd.read_sql_query(query_6_1, connection)
data

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [183]:
# текст запроса
query_6_2 = f'''select count(*)
                from vacancies 
                WHERE 
                (lower(name) LIKE '%data scientist%' 
                or lower(name) LIKE '%data science%'
                or lower(name) LIKE '%исследователь данных%'
                or (name LIKE '%ML%' and lower(name) not like '%html%')
                or lower(name) LIKE '%machine learning%'
                or lower(name) LIKE '%машинн%обучен%%')
                and (lower(name) LIKE '%junior%' or lower(experience) Like '%нет опыт%' or lower(employment) Like '%стаж%')

                '''

In [184]:
# результат запроса
data1 = pd.read_sql_query(query_6_2, connection)
data1

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [185]:
# текст запроса
query_6_3 = f'''select count(*)
                from public.vacancies 
                WHERE 
                (lower(key_skills) like '%sql%' or lower(key_skills) like '%postgres%')                
                and
                (lower(name) LIKE '%data scientist%' 
                or lower(name) LIKE '%data science%' 
                or lower(name) LIKE '%исследователь данных%'
                or (name LIKE '%ML%' and lower(name) not like '%html%')
                or lower(name) LIKE '%machine learning%'
                or lower(name) LIKE '%машинн%обучен%')

                '''

In [186]:
# результат запроса
data2 = pd.read_sql_query(query_6_3, connection)
data2

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [187]:
# текст запроса
query_6_4 = f'''select count(*)
                from public.vacancies 
                WHERE           
                (lower(name) LIKE '%data scientist%' 
                or lower(name) LIKE '%data science%'             
                or lower(name) LIKE '%исследователь данных%'
                or (name LIKE '%ML%' and lower(name) not like '%html%')
                or lower(name) LIKE '%machine learning%'
                or lower(name) LIKE '%машинн%обучен%%')
                and (lower(key_skills) LIKE '%python%')
                
                '''

In [188]:
# результат запроса
data4 = pd.read_sql_query(query_6_4, connection)
data4

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [189]:
# текст запроса
query_6_5 = f'''select round(avg(LENGTH(key_skills) - LENGTH(replace(key_skills, CHR(9),'')))+1,2)
                from public.vacancies
                WHERE 
                (lower(name) LIKE '%data scientist%'
                or lower(name) LIKE '%data science%'
                or lower(name) LIKE '%исследователь данных%'
                or (name LIKE '%ML%' and lower(name) not like '%html%')
                or lower(name) LIKE '%machine learning%'
                or lower(name) LIKE '%машинн%обучен%%')
                and (key_skills is not null)
                
                '''

In [190]:
# результат запроса
skill = pd.read_sql_query(query_6_5, connection)
skill

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [191]:
# текст запроса
query_6_6 = f'''select experience, sum(coalesce(salary_from, 0) + coalesce(salary_to, 0))/(count(salary_from) + count(salary_to))
                from public.vacancies 
                WHERE 
                (lower(name) LIKE '%data scientist%'
                or lower(name) LIKE '%data science%'
                or lower(name) LIKE '%исследователь данных%'
                or (name LIKE '%ML%' and lower(name) not like '%html%')
                or lower(name) LIKE '%machine learning%'
                or lower(name) LIKE '%машинн%обучен%%')
                and (salary_from is not NULL or salary_to is not null)
                group by 1
             
                '''

In [192]:
# результат запроса
salary = pd.read_sql_query(query_6_6, connection)
salary

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           experience  ?column?
0           Нет опыта     79000
1  От 1 года до 3 лет    147177
2       От 3 до 6 лет    244769

***

In [193]:
# выводы по предметному анализу
# В базе существует 1771 вакансий, связанных с данными, 51 вакансия из них не требует опыт работы или опыт минимальный. Из 1771 вакансий в 201 требуется ключевой навык SQL или postgres, в 351 навык знание Python. В среднем по Data Science указывают 6,41 ключевых навыков в вакансии.

# Общий вывод по проекту

In [194]:
# подведем итог исследования, обобщите выводы
# На данный момент в базе 294 разных сфер деятельности в 1362 регионах по которой 49197 вакансий и 23501 работодателей. 
#Наибольшее количество вакансий в регионах - Москва, Санкт-Петербург, Минск, Новосибирск, Алматы. 
# Опираясь на уровень заработной плате, можно сделать вывод что средние значения для нижней границы 71.065 руб. и верхней 110.537 руб. по данным примерно половины вакансий. 
# Самый популярный тип трудоустройства «Полная занятость» при удаленном или полном рабочем дне и опытом работы от 1 до 3 лет, а также от 3 до 6 лет
#В топ 5 по количеству вакансий и регионов присутствия в России входят Яндекс, Ростелеком, Тинькофф и Газпром нефть. Яндекс является лидером.
#1771 вакансий, связанных с данными, 51 вакансия из них не требует опыт работы или опыт минимальный. Из 1771 вакансий в 201 требуется ключевой навык SQL или postgres, в 351 навык знание Python. В среднем по Data Science указывают 6,41 ключевых навыков. 
#Самое большое количество вакансий в сфере деятельности по Разработке программного обеспечения.

In [196]:
# здесь можно (это будет плюсом) провести дополнительные исследования данных
# Список компаний которые опубликовали вакансии  в области данных и которые следует рассмотреть кандидату после завершения курса по Data Science.
query_6_7 = f'''select e.name, count(v.id)
                from public.vacancies v
                join employers e on e.id = v.employer_id 
                WHERE 
                (lower(v.name) LIKE '%data scientist%'
                or lower(v.name) LIKE '%data science%'
                or lower(v.name) LIKE '%исследователь данных%'
                or (v.name LIKE '%ML%' and lower(v.name) not like '%html%')
                or lower(v.name) LIKE '%machine learning%'
                or lower(v.name) LIKE '%машинн%обучен%%')
                and (lower(v.name) LIKE '%junior%' or lower(v.experience) Like '%нет опыт%' or lower(v.employment) Like '%стаж%')
                group by 1
                having count(v.id) > 1
                order by 2 desc
                '''
salary = pd.read_sql_query(query_6_7, connection)
salary

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                                               name  count
0                                    Банк ВТБ (ПАО)     10
1                                            Comexp      3
2  The Skolkovo Institute of Science and Technology      3
3                                     SteadyControl      2
4                                            Диплей      2
5     СтарЛайн, Научно-производственное объединение      2

In [235]:
# Топ по количество вакансий по сфера деятельности.
query_6_8 = f'''select i.name, count(v.id)
                from public.industries i
                join public.employers_industries ei on ei.industry_id = i.id
                join public.vacancies v on ei.employer_id = v.employer_id
                group by 1
                order by 2 desc
                limit 5

                '''
industry = pd.read_sql_query(query_6_8, connection)
industry

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                                                name  count
0                Разработка программного обеспечения  12499
1  Системная интеграция,  автоматизации технологи...  11034
2  Интернет-компания (поисковики, платежные систе...   6413
3                                               Банк   2742
4                                    Мобильная связь   1585